Repository: Djazil4ik/DAH-Solar
Catalog: main/locale/*/LC_MESSAGES/django.po
Languages: uz

source: What are you looking for?
uz: Siz nimani qidiryapsiz?

source: Language
uz: Til

source: Get in touch
uz: Aloqada bo'ling

source: Tel
uz: Telba

source: Telegram
uz: Telegramma

source: Need Help
uz: Yordam kerak

source: Home
uz: Uy

source: About Us
uz: Biz haqimizda

source: Products
uz: Mahsulotlar

source: News
uz: Yangiliklar

source: Contact Us
uz: Biz bilan bog'lanish

source: Hot Products
uz: Issiq mahsulotlar

source: DAH Solar - Reinvents PV Module
uz: Dah Quyosh - Qayta tiklaydi PV modul

source: Projects
uz: Loyihalar

source: Overview
uz: Umumiy nuqtai nazar

source: DAH Factories
uz: Dah ficts

source: Vision & Mission
uz: Vision va Missiya

source: Our Products
uz: Bizning mahsulotlarimiz

source: Quality First, Service Foremost
uz: Birinchi navbatda sifat, xizmatni mamert

source: View More Products
uz: Ko'proq mahsulotlarni ko'rish
